003_heatsink/ana001_base/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object blockMeshDict;
}

scale 0.001;

vertices
(
    ( -9  -20   0) //0
    ( 51  -20   0) //1
    ( 51   80   0) //2
    ( -9   80   0) //3
    ( -9  -20  25) //4
    ( 51  -20  25) //5
    ( 51   80  25) //6
    ( -9   80  25) //7
);
 
blocks
(
    hex (0 1 2 3 4 5 6 7) (15 20 5) simpleGrading (1 1 1)
);
 
edges
(
);
 
boundary
(
);
 
mergePatchPairs
(
);

