003_heatsink/ana001_base/system/air/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    XMin
    {
        type            wall;
    }
    XMax
    {
        type            wall;
    }
    YMin
    {
        type            patch;
    }
    YMax
    {
        type            patch;
    }
    ZMin
    {
        type            wall;
    }
    ZMax
    {
        type            wall;
    }
    air_to_heatsink
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    heatsink;
        samplePatch     heatsink_to_air;
    }
}

U
{
    internalField   uniform (0 -0.5 0);

    boundaryField
    {
        "(XMin|XMax|ZMin|ZMax)"
        {
            type            noSlip;
        }
        YMin
        {
            // type zeroGradient;
            type    pressureInletOutletVelocity;
		    value    $internalField;
        }
        YMax
        {
            type            fixedValue;
            value           $internalField;
        }
        "air_to_.*"
        {
            type    fixedValue;
            value    uniform (0 0 0);
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }
    }
}

T
{
    internalField   uniform 293.15;

    boundaryField
    {
        "(XMin|XMax|ZMin|ZMax|YMin)"
        {
            type            zeroGradient;
        }
        YMax
        {
            type            fixedValue;
            value           uniform 293.15; // 20 degC
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }

        "air_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 293.15;
        }
    }
}

p_rgh
{
    internalField   uniform 1e5;

    boundaryField
    {
        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 1e5;
        }
        YMin
        {
            type totalPressure;
            p0 uniform 100000;
            value uniform 100000;
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }
    }
}

p
{
    internalField   uniform 1e5;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 1e5;
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }
    }
}

epsilon
{
    // Set the value on all bc to non-zero. Not used in simulation
    // since zeroGradient; only used in initialisation.
    internalField   uniform 0.01;

    boundaryField
    {
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        YMin
        {
            type    inletOutlet;
            inletValue    uniform 1.35e-05;
            value    uniform 1.35e-13;
        }
        YMax
        {
            type            turbulentMixingLengthDissipationRateInlet;                                                                                                          
            mixingLength    0.01;       // 1cm - half channel height                                                                                                            
            value           $internalField; 
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        YMin
        {
            type    inletOutlet;
            inletValue    uniform 1.35e-05;
            value    uniform 1.35e-13;
        }
        YMax
        {
            type    turbulentIntensityKineticEnergyInlet;
            intensity    0.03;
            value    $internalField;
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }
    }

}

alphat
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            compressible::alphatWallFunction;
            Prt             0.85;
            value           uniform 0;
        }
        "(YMin|YMax)"
        {
            type            calculated;                                                                                                                                                                                                                   
            value           uniform 0;                                                                                                                                                                                                                                                
        }
        // "procBoundary.*"
        // {
        //     type            processor;
        // }
    }
}

// ************************************************************************* //
